Revit 2027 API
ExternalServices.BuiltInExternalServices.GenericRepoHelperService Property
 Unique service id.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId GenericRepoHelperService { get; }
Public Shared ReadOnly Property GenericRepoHelperService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ GenericRepoHelperService {
	ExternalServiceId^ get ();
}
static member GenericRepoHelperService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace